Revit 2027 API
UpdaterRegistry.AddTrigger Method
Overload List
Name | Description
AddTrigger(UpdaterId, ElementFilter, ChangeType) |  Adds trigger with the specified element filter and ChangeType for all documents associated with this Updater
AddTrigger(UpdaterId, Document, ElementFilter, ChangeType) |  Adds trigger with the specified element filter and ChangeType for the specified document
AddTrigger(UpdaterId, Document, ICollection<ElementId>, ChangeType) |  Adds a trigger to an updater with specified set of elements and ChangeType
Top
See Also
Reference
UpdaterRegistry Class
Autodesk.Revit.DB Namespace